In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
df = DataFrame(data=np.random.randint(0, 100, size=(5, 6)))
df

    0   1   2   3   4   5
0  82   9  14  73  33  96
1  29  92  61  51  58  20
2  74  60  94  79  72  53
3  25   7  36  47  96  54
4  94  86  95   4   1  39

In [4]:
df.replace(to_replace=7, value='Two')

    0    1   2   3   4   5
0  82    9  14  73  33  96
1  29   92  61  51  58  20
2  74   60  94  79  72  53
3  25  Two  36  47  96  54
4  94   86  95   4   1  39

In [5]:
df.replace(to_replace={1: 'one'})

    0   1   2   3    4   5
0  82   9  14  73   33  96
1  29  92  61  51   58  20
2  74  60  94  79   72  53
3  25   7  36  47   96  54
4  94  86  95   4  one  39

In [11]:
df.replace(to_replace={3: 4}, value='four')

    0   1   2     3   4   5
0  82   9  14    73  33  96
1  29  92  61    51  58  20
2  74  60  94    79  72  53
3  25   7  36    47  96  54
4  94  86  95  four   1  39

In [12]:
dic = {
    'name':['张三', '李四', '张三'],
    'salary':[15000, 20000, 15000]
}
df = DataFrame(data=dic)
df

  name  salary
0   张三   15000
1   李四   20000
2   张三   15000

In [14]:
dic = {
    '张三':'tom',
    '李四':'jack'
}
df['e_name'] = df['name'].map(dic)
df

  name  salary e_name
0   张三   15000    tom
1   李四   20000   jack
2   张三   15000    tom

In [15]:
def after_sal(s):
    return s - (s - 3000) * 0.5

df['after_sal'] = df['salary'].map(after_sal)
df

  name  salary e_name  after_sal
0   张三   15000    tom     9000.0
1   李四   20000   jack    11500.0
2   张三   15000    tom     9000.0

In [ ]:
df = DataFrame()